//&НаКлиенте
//Процедура ПолучитьСписокКонтрагентов(Команда)
//	Результат = ПолучитьСписокКонтрагентовНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКонтрагента(Команда)
	Результат = ОтправитьКонтрагентаНаСервере();
КонецПроцедуры
              
//&НаКлиенте
//Процедура УдалитьКонтрагента(Команда)
//	Результат = УдалитьКонтрагентаНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьКонтрагента(Команда)
//	Результат = ОбновитьКонтрагентаНаСервере();
//КонецПроцедуры


//&НаСервере
//Функция ПолучитьСписокКонтрагентовНаСервере()
//	Возврат web_Справочники.UsersGET();
//КонецФункции

&НаСервере
Функция ОтправитьКонтрагентаНаСервере()
	Возврат web_Справочники.ОтправитьПользователя(Объект.Контрагент, Объект.Пароль, Истина);
КонецФункции

//&НаСервере
//Функция УдалитьКонтрагентаНаСервере()
//	Возврат web_Справочники.UsersDELETE(Объект.Контрагент);
//КонецФункции

//&НаСервере
//Функция ОбновитьКонтрагентаНаСервере()
//	Возврат web_Справочники.UsersPATCH(Объект.Контрагент, Объект.Пароль);
//КонецФункции

