Процедура ДобавитьЗапись(СсылкаНаОбъект) Экспорт
	МенеджерЗаписи = РегистрыСведений.web_СписокОбменаССайтом.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ДобавитьЗаписи(МассивСсылок) Экспорт
	//НаборЗаписей = РегистрыСведений.Dim_СписокОбменаССайтом.СоздатьНаборЗаписей();  
	//
	//Для Каждого ТекЗнач Из МассивСсылок Цикл
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.СсылкаНаОбъект = ТекЗнач;
	//КонецЦикла;                              
	//
	//НаборЗаписей.Записать();
	
	Для Каждого ТекЗнач Из МассивСсылок Цикл
		ДобавитьЗапись(ТекЗнач);
	КонецЦикла;
КонецПроцедуры