
Функция echoGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK", КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция exchPOST(Запрос)
	КодОтвета = 200;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДанныеJSON = Запрос.ПолучитьТелоКакСтроку();
		
		ИменаСвойствСоЗначениямиДата = Новый Массив;
		ИменаСвойствСоЗначениямиДата.Добавить("updated_at");
		ИменаСвойствСоЗначениямиДата.Добавить("date_time");
		
		Данные = web_Обмен.ПрочитатьСтрокуJSON(ДанныеJSON, ИменаСвойствСоЗначениямиДата);
		
		ДанныеЗаказа = Данные.Получить("order");
		Если ДанныеЗаказа = Неопределено Тогда
			ВызватьИсключение "Ошибка чтения заказа в изменении.";
		КонецЕсли;
		
		Результат = web_Документы.ДобавитьОбновитьЗаказ(ДанныеЗаказа);
		Если Результат = Неопределено Тогда
			ВызватьИсключение "Ошибка добавления / обновления заказа.";
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КодОтвета = 400;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.УстановитьТелоИзСтроки("?", КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции
