Функция ОтправитьНаСайт(СсылкаНаОбъект, ПолнаяВыгрузка) Экспорт
	Возврат web_Справочники.ОтправитьДоговор(СсылкаНаОбъект, ПолнаяВыгрузка);
КонецФункции

Функция ПолучитьСвязанныеСсылки(СсылкаНаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Партнер КАК Партнер,
		|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	СписокСсылок = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СписокСсылок.Вставить(СсылкаНаОбъект, 0);	
		Возврат СписокСсылок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МаксимальныйПриоритет = 0;
	web_ОбщегоНазначенияПовтИсп.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Партнер, СписокСсылок, МаксимальныйПриоритет);
	web_ОбщегоНазначенияПовтИсп.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Контрагент, СписокСсылок, МаксимальныйПриоритет);
	web_ОбщегоНазначенияПовтИсп.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.Организация, СписокСсылок, МаксимальныйПриоритет);
	
	СписокСсылок.Вставить(СсылкаНаОбъект, МаксимальныйПриоритет + 1);
	Возврат СписокСсылок;
КонецФункции