&НаКлиенте
Процедура РегистрацияКонтрагентов(Команда)
	РегистрацияКонтрагентовНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияНоменклатуры(Команда)
	РегистрацияНоменклатурыНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияХарактеристик(Команда)
	РегистрацияХарактеристикНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолныйОбмен(Команда)
	ВыполнитьПолныйОбменНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыполнитьПолныйОбменНаСервере()
	web_Обмен.ВыполнитьОбменССайтом(Истина);
КонецПроцедуры


&НаСервере
Процедура ЗарегистрироватьОбъектыНаВыгрузкуНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокСсылок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");	
		РегистрыСведений.web_СписокОбменаССайтом.ДобавитьЗаписи(СписокСсылок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьОбъектыНаВыгрузку(Команда)
	ЗарегистрироватьОбъектыНаВыгрузкуНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура РегистрацияКонтрагентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл;
		web_Обмен.web_РегистрацияОбменаПриЗаписи(Выборка.Ссылка, Ложь);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РегистрацияНоменклатурыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл;
		web_Обмен.web_РегистрацияОбменаПриЗаписи(Выборка.Ссылка, Ложь);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РегистрацияХарактеристикНаСервере()
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл;
		web_Обмен.web_РегистрацияОбменаПриЗаписи(Выборка.Ссылка, Ложь);	
	КонецЦикла;
КонецПроцедуры