Функция ОтправитьЦеныНаСайт(Номенклатура, Характеристика, Цена, ПолнаяВыгрузка = Ложь) Экспорт
	Обновление = Ложь;
	ДанныеДляЗапроса = СформироватьДанныеДляЗапроса(Номенклатура, Характеристика, Цена); 
	
	АдресРесурса = web_Обмен.ПолучитьАдресРесурса("prices");
	
	Результат = web_Обмен.ОтправитьHTTPЗапрос("POST", АдресРесурса, ДанныеДляЗапроса);
	
	Если Результат.Код >= 300 Тогда
		Ошибка = web_Обмен.СформироватьОтвет(Результат);
		Сообщить(Ошибка);
		ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,, Ошибка);
	
		Возврат Неопределено
	КонецЕсли;
	
	ВозвращаемаяСтруктура = Новый Структура();
	ВозвращаемаяСтруктура.Вставить("Номенклатура", Номенклатура);
	ВозвращаемаяСтруктура.Вставить("Характеристика", Характеристика);
	Возврат ВозвращаемаяСтруктура;
КонецФункции

Функция СформироватьДанныеДляЗапроса(СсылкаНаОбъект, Характеристика, Цена)
	ДанныеНоменклатуры = Новый Соответствие;
	ДанныеНоменклатуры.Вставить("product", XMLСтрока(СсылкаНаОбъект));       
	ДанныеНоменклатуры.Вставить("price", Цена);
	
	ДанныеНоменклатуры.Вставить(
		"characteristic",
		?(
			ЗначениеЗаполнено(Характеристика), 
			XMLСтрока(Характеристика), 
			XMLСтрока(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка())
		)
	);
	
	Возврат ДанныеНоменклатуры;
КонецФункции