Функция ОтправитьНаСайт(СсылкаНаОбъект, ПолнаяВыгрузка) Экспорт
	//
	//	Отправить прикрепленное изображение (Присоединенный Файл)
	//
	//	Параметры:
	//
	//		СсылкаНаОбъект -- (Ссылка) ссылка на объект файла
	//
	//		ПолнаяВыгрузка -- (Булево) режим полной выгрузки  Истина/Ложь
	//
	
	web_ОбщегоНазначения.Трассировка("Отправить прикрепленное изображение: "+СсылкаНаОбъект);	
	Возврат web_Справочники.ОтправитьИзображение(СсылкаНаОбъект, ПолнаяВыгрузка);
КонецФункции

Функция ПолучитьСвязанныеСсылки(СсылкаНаОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	СписокСсылок = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СписокСсылок.Вставить(СсылкаНаОбъект, 0);	
		Возврат СписокСсылок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МаксимальныйПриоритет = 0;
	web_ОбщегоНазначения.ЗаписатьЗависимыеСсылкиПоОбъекту(Выборка.ВладелецФайла, СписокСсылок, МаксимальныйПриоритет);
	
	СписокСсылок.Вставить(СсылкаНаОбъект, МаксимальныйПриоритет + 1);
	Возврат СписокСсылок;
КонецФункции